Revit 2027 API
ParameterTypeId.PreferDimSideUiFilter Property
 "Prefer:": This is used by the UI to allow select prefer dimension side.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PreferDimSideUiFilter { get; }
Public Shared ReadOnly Property PreferDimSideUiFilter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PreferDimSideUiFilter {
	ForgeTypeId^ get ();
}
static member PreferDimSideUiFilter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace